tests/cases/runnerTree/0/U
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    inlet1
    {
        type            moldingInletVelocity;
        totalFlowRate   2e-07;
        gate            gate1;
        runner
        {
            inletTemperature 480;
            cp               2400;
            rho              800;
            viscosity { type powerLaw; K 1e4; n 0.5; }
            feed { length 0.05; diameter 0.005; }
            tree
            {
                m1    { parent feed; length 0.03; diameter 0.004; }
                m2    { parent feed; length 0.04; diameter 0.003; }
                gate1 { parent m1;   length 0.02; diameter 0.004; }
                gate2 { parent m2;   length 0.02; diameter 0.002; }
            }
        }
        value           uniform (0 0 0);
    }
    inlet2
    {
        type            moldingInletVelocity;
        totalFlowRate   2e-07;
        gate            gate2;
        runner
        {
            inletTemperature 480;
            cp               2400;
            rho              800;
            viscosity { type powerLaw; K 1e4; n 0.5; }
            feed { length 0.05; diameter 0.005; }
            tree
            {
                m1    { parent feed; length 0.03; diameter 0.004; }
                m2    { parent feed; length 0.04; diameter 0.003; }
                gate1 { parent m1;   length 0.02; diameter 0.004; }
                gate2 { parent m2;   length 0.02; diameter 0.002; }
            }
        }
        value           uniform (0 0 0);
    }
    vent    { type moldingVentVelocity; value uniform (0 0 0); }
    walls   { type noSlip; }
}
