tests/cases/runnerTree/system/verifyScript
verify-runner-tree.py
